{"English":"Eggplants always grow best under warm conditions.","Luganda":"Bbiringanya lubeerera  asinga kukulira mu mbeera ya bugumu","Runyankore":"Entonga buriijo zikurira omu mbeera y'obwire erikutagata","Acholi":"Bilinyanya pol kare dongo maber ka lyeto tye","Ateso":"Epoloi ebirinyanyi ojok apakio nu emwanar akwap.","Lugbara":"Birinyanya eyi zo kililiru ndeni angu driza ma alia."}
{"English":"Farmland is sometimes a challenge to farmers.","Luganda":"Ettaka ly'okulimirako n'okulundirako ebiseera ebimu kisoomooza abalimi","Runyankore":"Eitaka ry'okuhingamu, obumwe n'obumwe nirireetera abahingi oburemeezi.","Acholi":"Ngom me pur i kare mukene obedo peko madit bot lupur","Ateso":"Akiro nu alupok nes erai ationis kanejaas akoriok","Lugbara":"Amvu ma angu eri sa'wa azini 'diyisi 'ba amvu 'yapi 'diyi dri ewaru."}
{"English":"Farmers should be encouraged to grow more coffee.","Luganda":"Abalimi balina okukubirizibwa okwongera okulima emmwanyi","Runyankore":"Abahingi bashemereire kuhigwa bongyere okuhinga omwani .","Acholi":"Lupur omyero ki konygi wek nong miti me puru mwanyi","Ateso":"Ekot aisinyikokit akoriok akoru emwanyi loepol","Lugbara":"Le 'ba ma fe 'ba amvu 'yapi 'diyini ava kawa 'yazu drile."}
{"English":"Uganda is focusing on farming.","Luganda":"Uganda essira eritadde ku bulimi.","Runyankore":"Uganda eteire amaani aha buhingi n'oburiisa.","Acholi":"Uganda tye ka keme ki lok me pur","Ateso":"Uganda nes ejai akiro nu akoru.","Lugbara":"Kari Uganda niri eri asi'baza be amvu 'yaza ma dria."}
{"English":"Some plants die due to lack of sunlight.","Luganda":"Ebimera ebimu bifa olw'ebbula ly'omusana.","Runyankore":"Ebihingwa ebimwe nibyoma ahabw'okubura omushana.","Acholi":"jami apita mukene too woko pien pe ginongo ceng muromo","Ateso":"Icie ikorion etwakete naarai emamei akolong.","Lugbara":"Ori azi 'diyi odra te ituka ma akosi."}
{"English":"Where can we get good resistant varieties that are highly marketable?","Luganda":"Tusobola kuggya wa ebika ebirungi ebigumira embeera yonna bya ttunzi nnyo?","Runyankore":"Nitubaasa kwiha nkahi embibo nungi erikugumira ebihikiirizi kandi eine akatare?","Acholi":"Kwene ma watwero nongo kodi maber ma two pe cubu dok cato yot?","Ateso":"Aibo idumakini oni ikorion lu ipikoritos akolong ka adekasinei.","Lugbara":"Ama ecoki ori okpo 'dika cu be saaru 'diyi esu ngua?"}
{"English":"Cassava stems are always needed for planting.","Luganda":"Emiti gya muwogo lubeerera gyetaagibwa mu kusimba","Runyankore":"Ebiti bya muhogo eby'okubyara, butoosha nibyetengwa.","Acholi":"Tyen gwana pol kare mite me apita","Ateso":"Ekotoi akito nu emwogo kanu akoru.","Lugbara":"Le ola pati eyi ma aa o'du driasi sazaru ci."}
{"English":"The garden has diseased tomato plants.","Luganda":"Ennimiro erimu ennyaanya endwadde","Runyankore":"Omusiri gurimu enyaanya eziine oburwaire.","Acholi":"Poto man tye ki nyanya ma two obalo","Ateso":"Ejai enyanya lo edeka ecie musiri.","Lugbara":"Amvu 'da ma alea nyanya ori azo be 'diyi ci."}
{"English":"How do you access market information for sweet potatoes?","Luganda":"Ofuna otya obubaka ku kataale ka lumonde?","Runyankore":"Nootunga ota amakuru agarikukwata aha katare k'ebitakuri?","Acholi":"Inongo lok ma lubbe ki biacara me cato layata ki kwene?","Ateso":"Eipone bani idumununa ijo nuikamunitos esokoni lo acok?","Lugbara":"MI eco e'yo cu'a maku eyi ma dria ri niri esu geri ngosi?"}
{"English":"The radio station has given us a platform to sell our vegetables.","Luganda":"Laadiyo etuwadde akadaala okutunda enva endiirwa zaffe","Runyankore":"Reediyo etubaasiise kuraanga emboga zaitu kandi tukaziguza.","Acholi":"Redio stason omiyo ki wan yo me cato pot dek ma wa pure","Ateso":"Ejaiki esiteseni lo eredio oni ewai lo igwelanaret idiasio wok.","Lugbara":"Rediyo 'di fe amani angu amani ecozu ama ma tibi ini eyi ozizu."}
{"English":"Mobile phones have enabled me to get pesticide information for beans.","Luganda":"Essimu zinnyambyeko okufuna obubaka ku ddagala ly'ebijanjaalo","Runyankore":"Esimu z'omungaro zimpwereire okutunga amakuru agarikukwata aha mubazi gw'obukooko omu bihimba.","Acholi":"Cim cing okonya oweko anongo lok ma lubbe ki kit me nongo yat akira i muranga","Ateso":"Esipedo esimu loakan eong adumunun akiro nuikamunitos ekia lo emaroge.","Lugbara":"Simu eyi ko ma aza onita esuzu aro ogbi osu eyi ma dria 'diyi ma dria."}
{"English":"Last month, I needed passion fruit information.","Luganda":"Omwezi oguwedde, nayagala obubaka ku butunda","Runyankore":"Okwezi okuhweire, nkaba ninyetenga amakuru agarikukwata aha butunda.","Acholi":"Dwe mukato, abedo ki miti me nongo pwony i kom matunda","Ateso":"Olap je epuda eong akiro nuka ematuda.","Lugbara":"Imba ajerisi, ale ndra onita matunda ma dria."}
{"English":"Market information for bananas should be given to all farmers.","Luganda":"Obubaka ku katale k'amatooke bulina okuweebwa abalimi bonna","Runyankore":"Amakuru agarikukwata aha katare k'ebitookye, gashemereire kuhika abahingi boona.","Acholi":"Lok ma lubbe ki biacara me labolo omyero kimi ki lupur weng","Ateso":"Akiro nu esokoni nuikamunitos etaget ekot ijaikinai akoriok.","Lugbara":"Le 'ba ma fe 'ba amvu 'yapi 'diyini cu aje a'bua eyini ri 'ba dria dri."}
{"English":"Farmers need information on companies that have good seedlings for tomatoes.","Luganda":"Abalimi beetaaga obubaka ku makampuni agalina ensigo y'ennyaanya ennungi","Runyankore":"Abahingi bashemereire kumanya kampuni ezirikuguza embibo nungi y'enyanya.","Acholi":"Lupur mito ngec i kom luwil madongo calo kampuni matye ki kodi nyanya ma rwome malo","Ateso":"Ekotosi akoriok akiro nuikamunitos ikampunin luejaas ka ikito ludidika lu enyanya.","Lugbara":"Ba amvu 'yapi 'diyi le eyo oni amuti nyanya ori ala 'diyi be 'diyi ma dria."}
{"English":"Some of the shops where farmers can get fertilizers and good planting materials.","Luganda":"Amaduuka agamu abalimi gye basobola okufuna ebigimusa n'ebikozesebwa ebirungi mu kusimba","Runyankore":"Amaduuka agamwe ahu abahingi barikubaasa kutunga orwezo n'embibo nungi.","Acholi":"Dukan mogo ma lupur nongo iye mocam ki kodi cam apita me rwom ma malo","Ateso":"Icie idukai lu epedorete akoriok adumakin ikee lueyaunete ebolia ka iboro lu ikoris.","Lugbara":"Dukani ꞌba amvu ꞌyaꞌba ꞌdiyini fatalaiza pi jezu afa ori sazu onyiru ꞌdiyi be ꞌdiyi."}
{"English":"Farming programs on radio provide information on how to access cassava planting materials.","Luganda":"Pulogulaamu z'obulimi ku laadiyo ziwa obubaka ku ngeri y'okufunamu ebikozesebwa mu kusimba  muwogo.","Runyankore":"Puroguraamu z'obuhingi n'oburiisa aha reediyo, nizimanyisa abantu emyanya y'okwihamu embibo.","Acholi":"Purogram me pur ma I rediyo miyo ngec ma lubbe ki kit me nongo kodi gwana","Ateso":"Ainapeta nu oredio itolomunenete eipone lo idumunet akito nu emwogo kanu aira.","Lugbara":"Otita amvu 'yaza ma dria radio ma alia 'diyi 'ba amvu 'yapi 'diyi dri onita fe geri afa ndundu ola sazu 'diyi esuzu."}
{"English":"There are several cassava varieties that can grow in that area.","Luganda":"Waliwo ebika bya muwogo eby'enjawulo ebisobola okudda mu kifo ekyo","Runyankore":"Hariho emiringo y'embibo ya muhogo nyingi erikubaasa kwera omu mwanya ogwo.","Acholi":"Tye kwayi gwana mapat pat ma twero dongo i kabedo meno","Ateso":"Ipu iponesio lu emwogo lu epedorete apolo ejok aiboisit kangin.","Lugbara":"Ola wura ndundu 'diyi eco zo angu 'da ma alea ni"}
{"English":"When farmers get information about disease outbreaks early, it helps them to plan better.","Luganda":"Abalimi bwe bamanyisibwa amangu ku kubalukawo kw'obulwadde, kibayambako okweteekateeka obulungi","Runyankore":"Abahingi ku barikutunga amakuru agarikukwata aha kubarukaho kw'endwara nikibahwera  kwetebekanisa gye.","Acholi":"Ka lupur onongo kwena con ma lubbe ki two ma balo cam ma i poto, ci konyo weko giyubbe con","Ateso":"Karai elingakisi akoriok adumun akiro nu abwangun na adeka, ingarakini kes akapanakin.","Lugbara":"ꞌBa amvu ꞌyaꞌba ꞌdiyi ka oꞌduko azo efupi ꞌdiyini ꞌdiyi esu drioru, eri yi ma azako otita ꞌyezu kililiru."}
{"English":"Farmers can benefit a lot from advice on disease control.","Luganda":"Abalimi basobola okugasibwa ennyo okuva mu kuwabulwa ku kutangira obulwadde","Runyankore":"Abahingi nibagasirwa kihango baahaburwa oku barikubaasa kuzibira endwara","Acholi":"Lupur twero nongo kony ma dit ka gunongo ngec me gengo onyo cango two ma balo jami ma i poto","Ateso":"Epedorete akoriok aimedaun ejok kanejaas aicoreta nu itikitikere adeka.","Lugbara":"ꞌBa amvu ꞌyaꞌba ꞌdiyi nga orodri esu angiri yi ka oꞌduko azo ma dri atriza ma dria raria."}
{"English":"Every Monday, farmers are given advice on coffee growing.","Luganda":"Buli Mande, abalimi bawabulwa ku nnima y'emmwanyi","Runyankore":"Buri rw'Okubanza, abahingi nibatunga obuhabuzi aha ku barikubaasa kuhinga omwani.","Acholi":"I ceng baraja weng, lupur nongo pwony ma lubbe ki diro me puru mwanyi","Ateso":"Kangin balasa, ijanakino akoriok aicoreta nuka akoru emwanyi.","Lugbara":"O'du alu driasi, 'ba amvu 'yapi 'diyi imbata esu kawa ezoza ma dria."}